class LuciferMoringstar(object):

    DEFAULT_MSG = """**Hᴇʟʟᴏ 👋, {mention}

I Aᴍ Vɪɴᴄᴇɴᴢᴏ Bᴏᴛ. I Cᴀɴ Pʀᴏᴠɪᴅᴇ Mᴏᴠɪᴇꜱ Iɴ Gʀᴏᴜᴩꜱ

Iᴛ Vᴇʀy Eᴀꜱy Wᴀy Jᴜꜱᴛ Aᴅᴅ Mᴇ Tᴏ Yᴏᴜʀ Gʀᴏᴜᴩ Aɴᴅ Mᴀᴋᴇ Aᴅᴍɪɴ.

Tʜᴀᴛꜱ Aʟʟ I'ʟʟ Pʀᴏᴠɪᴅᴇ Mᴏᴠɪᴇꜱ Tʜᴇʀᴇ

Fᴏʀ Mᴏʀᴇ Iɴꜰᴏʀᴍᴀᴛɪᴏɴ Cʟɪᴄᴋ Hᴇʟᴘ Bᴜᴛᴛᴏɴ**"""

    HELP_MSG = """**╭────[ Vɪɴᴄᴇɴᴢᴏ ]───⍟
│
├ /start : Cʜᴇᴄᴋ Iꜰ Aᴍ Aʟɪᴠᴇ
│
├ /about : Aʙᴏᴜᴛ Mᴇ
│
├ Pᴏᴡᴇʀᴇᴅ Bʏ : [ƛƖƠM ƁƠƬƧ](https://t.me/AIOM_BOTS)
│
╰──────[ Tʜᴀɴᴋ Yᴏᴜ ]───⍟**"""

    ABOUT_MSG = """
╭────[ Vɪɴᴄᴇɴᴢᴏ ]───⍟
│
├ Bᴏᴛ Nᴀᴍᴇ : [Vɪɴᴄᴇɴᴢᴏ](https://t.me/VINCENZO_CASSANOS_BOT)
│
├ Cʜᴀɴɴᴇʟ : [ƛƖƠM ƁƠƬƧ](https://t.me/AIOM_BOTS)
│
├ Vᴇʀsɪᴏɴ : 1.0.2.2  Bᴇᴛᴀ
│
├ Sᴏᴜʀᴄᴇ : [Cʟɪᴄᴋ Hᴇʀᴇ](https://github.com/PR0FESS0R-99/LuciferMoringstar_Robot)
│
├ Sᴇʀᴠᴇʀ : [Hᴇʀᴏᴋᴜ](https://www.heroku.com)
│
├ Dᴇᴠᴇʟᴏᴘᴇʀ : [Cʟɪᴄᴋ Hᴇʀᴇ](https://t.me/PR0FESS0R_99)
│
├ Eᴅɪᴛɪɴɢ : [Cʟɪᴄᴋ Hᴇʀᴇ](https://t.me/ajvadntr2)
│
├ Pᴏᴡᴇʀᴇᴅ Bʏ : [ƛƖƠM ƁƠƬƧ](https://t.me/AIOM_BOTS)
│
├ Cʀᴇᴅɪᴛꜱ : Sᴜʙɪɴ Pʀᴏꜰᴇꜱꜱᴏʀ-99
│
╰──────[ Tʜᴀɴᴋ Yᴏᴜ ]───⍟"""

    FILE_CAPTIONS = """Tɪᴛʟᴇ {title}\n\nSɪᴢᴇ {size}"""

    PR0FESS0R_99 = """
**ADMINS COMMANDS**

 » /broadcast - Reply Any Media Or Message
 » /delete - Reply Files
 » /deleteall - Delete All Files
 » /total - How Many Files Saved
 » /logger - Get Bot Logs
 » /channel - Add Channel List"""

    ADD_YOUR_GROUP = """**__ഞാൻ ജോലി ചെയ്യുന്ന ഗ്രൂപ്പിൽ ചേരൂ, നിങ്ങൾക്ക് ആവശ്യമുള്ള എല്ലാ സിനിമകളും  ആ ഗ്രൂപ്പിൽ അഭ്യർത്ഥിക്കാം! ഇവിടെ അഭ്യർത്തിക്കരുത്..😤__**"""
    SPELL_CHECK = """
Hᴇʟʟᴏ 👋 {mention},

Cᴏᴜʟᴅɴ'ᴛ Fɪɴᴅ {query}?  Pʟᴇᴀsᴇ Cʜᴇᴄᴋ Yᴏᴜʀ Rᴇǫᴜᴇsᴛ Mᴏᴠɪᴇ Mᴀᴍᴇ
"""


    GET_MOVIE_2 = """
• Rᴇǫᴜᴇsᴛᴇʀ : {mention}

• Rᴇǫᴜᴇsᴛᴇᴅ Mᴏᴠɪᴇ : {query}

° Rᴇǫᴜᴇsᴛ Sᴇɴᴛ Sᴜᴄᴄᴇssꜰᴜʟʟʏ

© **{chat}**"""
